app/controllers/registrations_controller.rb

  def index
    @registrations = Registration.all
---
SELECT "registrations".* FROM "registrations"

  def new
    @registration = Registration.new
    @course = Course.find_by id: params["course_id"]
---
SELECT  "courses".* FROM "courses"  WHERE "courses"."id" IS NULL LIMIT 1

  def create
    @registration = Registration.new registration_params.merge(email: stripe_params["stripeEmail"],
                                                               card_token: stripe_params["stripeToken"])
    raise "Please, check registration errors" unless @registration.valid?
    @registration.process_payment
    @registration.save
---
INSERT INTO "registrations" ("card_token", "company", "course_id", "created_at", "email", "full_name", "telephone", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_registration
      @registration = Registration.find(params[:id])
---
SELECT  "registrations".* FROM "registrations"  WHERE "registrations"."id" = ? LIMIT 1  [["id", 1]]